////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры и функции общего назначения:
// - для Получения ссылок на сотрудника и ресторан текущего пользователя;
// - для получения ссылки из параметров сеанса ссылки на сотрудника текущего пользователя;
// - для получения ссылки из параметров сеанса ссылки на ресторан текущего пользователя;//  
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныеПроцедурыИФункции

// Возврат ссылки пользователя и ресторана.
// 
// Параметры:
//  Имя Имя
// 
// Возвращаемое значение:
//  Структура - Возврат ссылки пользователя и ресторана:
// * Ресторан 
// * Сотрудник 
Функция ВозвратСсылкиПользователяИРесторана(Имя) Экспорт
	
		ТекПотльзовательСтруктура = Новый Структура;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Ресторан.Ссылка КАК РесторанСсылка,
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ИмяПользователя = &ИмяПользователя";
		Запрос.УстановитьПараметр("ИмяПользователя",Имя);

		РезультатЗапроса = Запрос.Выполнить(); 
		РезультатЗапроса = РезультатЗапроса.Выбрать();
		РезультатЗапроса.Следующий();
		ТекПотльзовательСтруктура.Вставить("Ресторан", РезультатЗапроса.РесторанСсылка);
		ТекПотльзовательСтруктура.Вставить("Сотрудник", РезультатЗапроса.Ссылка);
		Возврат ТекПотльзовательСтруктура; 
		
КонецФункции

// Вернуть значение параметра сеанса текущий пользователь.
// 
// Возвращаемое значение:
//  СправочникСсылка.Сотрудники - Вернуть значение параметра сеанса текущий пользователь
Функция ВернутьЗначениеПараметраСеансаТекущийПользователь () Экспорт
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

// Вернуть значение параметра сеанса текущий ресторан.
// 
// Возвращаемое значение:
//  СправочникСсылка.Рестораны - Вернуть значение параметра сеанса текущий ресторан
Функция ВернутьЗначениеПараметраСеансаТекущийРесторан () Экспорт
	
	Возврат ПараметрыСеанса.ТекущийРесторан;
	
КонецФункции

#КонецОбласти



