
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РазряднаяСетка
	Движения.РазряднаяСетка.Записывать = Истина;
	Для Каждого ТекСтрокаНазначениеОклада Из НазначениеОклада Цикл
		Движение = Движения.РазряднаяСетка.Добавить();
		Движение.Период = Дата;
		Движение.Разряд = ТекСтрокаНазначениеОклада.Разряд;
		Движение.Ресторан = Ресторан;
		Движение.Оклад = ТекСтрокаНазначениеОклада.Оклад;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
