
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Дата = '00010101' Тогда 
		Дата = ТекущаяДата();
		КартуВыдал = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
   	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидочныеКарты.Ссылка КАК Ссылка,
		|	СкидочныеКарты.ВерсияДанных КАК ВерсияДанных,
		|	СкидочныеКарты.ПометкаУдаления КАК ПометкаУдаления,
		|	СкидочныеКарты.Код КАК Код,
		|	СкидочныеКарты.Клиент КАК Клиент,
		|	СкидочныеКарты.Дата КАК Дата,
		|	СкидочныеКарты.КартуВыдал КАК КартуВыдал,
		|	СкидочныеКарты.ТипКарты КАК ТипКарты,
		|	СкидочныеКарты.Размер КАК Размер,
		|	СкидочныеКарты.Предопределенный КАК Предопределенный,
		|	СкидочныеКарты.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.СкидочныеКарты КАК СкидочныеКарты
		|ГДЕ
		|	СкидочныеКарты.Клиент = &Клиент
		|	И СкидочныеКарты.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;    
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		Сообщить("у КЛИЕНТА КАРТА уже есть");
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры
