
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Ресторан = ПараметрыСеанса.ТекущийРесторан;

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКоличествоПриИзменении(Элемент)
	ПодсчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЦенаПриИзменении(Элемент)
	ПодсчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ПодсчетСуммы() 
	
	СтрокаТЧ = ЭтаФорма.Элементы.Номенклатура.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	

КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Итого = Объект.Номенклатура.Итог("Сумма");
КонецПроцедуры

