
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИсторияНачисленияЗароботнойПлаты
	Движения.ИсторияНачисленияЗароботнойПлаты.Записывать = Истина;
	Движение = Движения.ИсторияНачисленияЗароботнойПлаты.Добавить();
	Движение.Период = Дата;
	Движение.Отвественный = Ответственный;

	// регистр ЗароботнаяПлата Приход
	Движения.ЗароботнаяПлата.Записывать = Истина;
	Для Каждого ТекСтрокаЗарплаты Из Зарплаты Цикл
		Движение = Движения.ЗароботнаяПлата.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Ресторан = Ресторан;
		Движение.Сотрудник = ТекСтрокаЗарплаты.Сотрудник;
		Движение.Должность = ТекСтрокаЗарплаты.Должность;
		Движение.Зарплата = ТекСтрокаЗарплаты.ЗаработнаяПлата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


