
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийРесторан()
		<> ПредопределенноеЗначение("Справочник.Рестораны.ЦентральныйОфис") Тогда
	
		ЭтаФорма.Доступность = Ложь;
		Сообщить("Этот документ доступен только в центральном офисе!");
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьСуммуДолга();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Ресторан) Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ЗаполнитьСуммуДолга()
	
КонецПроцедуры 

&НаКлиенте
Процедура РесторанПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Поставщик) Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ЗаполнитьСуммуДолга();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуДолга()
	
	СуммаДолга = УстановкаДолгаПередПоставщиком(Объект.Дата, Объект.Поставщик, Объект.Ресторан);
	Если СуммаДолга <> Неопределено Тогда
		
		Объект.СуммаПогашения = СуммаДолга;
		
	Иначе
		
		Объект.СуммаПогашения = 0;
		
	КонецЕсли;
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция УстановкаДолгаПередПоставщиком(Дата, Поставщик, Ресторан)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДолгиПоставщикамОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(&Период, ) КАК ДолгиПоставщикамОстатки
		|ГДЕ
		|	ДолгиПоставщикамОстатки.Поставщик = &Поставщик
		|	И ДолгиПоставщикамОстатки.Ресторан = &Ресторан";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Ресторан", Ресторан);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Если ВыборкаДетальныеЗаписи.СуммаОстаток < 0 Тогда
		
			Возврат (-ВыборкаДетальныеЗаписи.СуммаОстаток);
			
		Иначе
			
			Возврат 0;
		
		КонецЕсли;
		
	Иначе
		
		Возврат (Неопределено);
		
	КонецЕсли;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
	
		Объект.Дата = ТекущаяДата();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти