#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьСертификат(ТекущийОбъект) Экспорт

	НаборЗаписей = РегистрыСведений.Сертификаты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сертификат.Установить(ТекущийОбъект.СертификатОплаты);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	СуммаСертификата = ОбщийСервер.СуммаСертификата(ТекущийОбъект.СертификатОплаты);
	Запись 					 = НаборЗаписей.Добавить();
	Запись.Период			 = ОбщийСервер.ДатаВыдачиСертификата(ТекущийОбъект.СертификатОплаты);
	Запись.Сертификат 		 = ТекущийОбъект.СертификатОплаты;
	Запись.СуммаСертификата	 = СуммаСертификата;
	Запись.Погашен			 = Истина;
		
	///Если сертификат был применен или равен сумме заказа то он будет 0
	Если ТекущийОбъект.Итого = 0 Тогда
		Запись.СуммаЗаказа	 = СуммаСертификата;
	Иначе
		Запись.СуммаЗаказа	 = ТекущийОбъект.Итого;
	КонецЕсли;

	Если СуммаСертификата > ТекущийОбъект.Итого Тогда
		Запись.НеиспользованнаяСуммаСертификата 	= СуммаСертификата - ТекущийОбъект.Итого;
	Иначе
		Запись.НеиспользованнаяСуммаСертификата 	= 0;
	КонецЕсли;

	НаборЗаписей.Записать();	

КонецПроцедуры

#КонецОбласти