
Функция GetOrdersList(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Представление(Заказы.Ссылка) КАК Referens,
		|	Заказы.Номер КАК Number,
		|	Заказы.Дата КАК Date,
		|	Представление(Заказы.Официант) КАК Employee,
		|	Представление(Заказы.Ресторан) КАК Restourant,
		|	Заказы.Итого КАК Summary,
		|	Представление(Заказы.Клиент) КАК Client,
		|	Представление(Заказы.Доставка) КАК Delivery,
		|	Представление(Заказы.Курьер) КАК courier,
		|	Представление(Заказы.ДатаЗакрытияЗаказа) КАК CloseDate
		|ИЗ
		|	Документ.Заказы КАК Заказы";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	МассивРезультатов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура("Referens, Number, Date, Employee, Restourant, Summary, Client, Delivery, courier, CloseDate");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		МассивРезультатов.Добавить(Структура);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивРезультатов);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.ANSI);

	
	
	
	Возврат Ответ;
КонецФункции

Функция GetOrdersListGetOrder(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

//Функция GetOrdersListGetOrder(Запрос)
//	Ответ = Новый HTTPСервисОтвет(200);
//	
//	Возврат Ответ;
//КонецФункции
