
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Дата = '00010101' Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Ресторан = ПараметрыСеанса.ТекущийРесторан;
		Объект.Сумма = СуммаЗаказовЗаДень(Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СуммаЗаказовЗаДень(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СуммаЗаказовКлиентыОбороты.СуммаЗаказаОборот КАК СуммаЗаказаОборот
		|ИЗ
		|	РегистрНакопления.СуммаЗаказовКлиенты.Обороты(&НачалоДня, &КонецДня, День, ) КАК СуммаЗаказовКлиентыОбороты
		|ГДЕ
		|	СуммаЗаказовКлиентыОбороты.Ресторан.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийРесторан);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаЗаказаОборот;
	КонецЦикла; 
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СуммаЗаДень = СуммаЗаказовЗаДень(Объект.Дата);
	Если СуммаЗаДень = 0 Тогда
		Объект.Сумма = 0;
	Иначе
		Объект.Сумма = СуммаЗаДень;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСмену(Команда)
	Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение));
КонецПроцедуры
