
Процедура ПриЗаписи(Отказ)



КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Столы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Столы КАК Столы
		|ГДЕ
		|	Столы.НомерСтола = &НомерСтола
		|	И Столы.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("НомерСтола", НомерСтола);
	Запрос.УстановитьПараметр("Владелец", Владелец);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		Сообщить("Такой стол уже есть");
	КонецЦикла;
КонецПроцедуры
