
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныБлюд
	Движения.ЦеныБлюд.Записывать = Истина;
	Для Каждого ТекСтрокаБлюда Из Блюда Цикл
		Движение = Движения.ЦеныБлюд.Добавить();
		Движение.Период = Дата;
		Движение.Блюдо = ТекСтрокаБлюда.Блюдо;
		Движение.Автор = Автор;
		Движение.Цена = ТекСтрокаБлюда.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
