#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполнитьЗаписьПриПревышенииСуммы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Проверка, Если новй документ, то подставляем значения
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата 	= ТекущаяДата();
		Объект.Ресторан = ПараметрыСеанса.ТекущийРесторан;
		Объект.Директор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ВыполнитьЗаписьПриПревышенииСуммы = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для каждого ТекущаяСтрока Из Объект.Зарплаты Цикл
	
		Если ТекущаяСтрока.ЗаработнаяПлата < 0 Тогда
			Сообщить("Начисление меньше нуля! Впишите корректные данные!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	
	КонецЦикла;
	
	
	АвансПревышаетНачисление 		= ЛОЖЬ;
	СтруктураПроверкиНачисления 	= Новый Структура;
	СтруктураПроверкиНачисления 	= ПередЗаписьюНаСервере();
	
	Если СтруктураПроверкиНачисления.Количество() > 0 Тогда
		 АвансПревышаетНачисление	= СтруктураПроверкиНачисления.АвансПревышаетНачисление;
		 ТекстСообщения				= СтруктураПроверкиНачисления.ТекстСообщения;
	КонецЕсли;
	

	Если АвансПревышаетНачисление и Не ВыполнитьЗаписьПриПревышенииСуммы Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Продолжить запись?");
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Зарплаты.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПерезаписи",ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "В таблице уже есть данные, перезаписать?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Перезаписать?");
	Иначе
		ВыполнитьЗаписьПриПревышенииСуммы = Истина;
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Проверка выплаты, не ушли ли в минус
&НаСервере
Функция ПередЗаписьюНаСервере()
	
	СтруктураПроверкиНачисления = Новый Структура;
			 
	АвансПревышаетНачисление = ЛОЖЬ;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗароботнаяПлатаОстатки.Ресторан КАК Ресторан,
		|	ЗароботнаяПлатаОстатки.Сотрудник КАК Сотрудник,
		|	ЗароботнаяПлатаОстатки.ЗарплатаОстаток КАК ЗарплатаОстаток
		|ИЗ
		|	РегистрНакопления.ЗароботнаяПлата.Остатки КАК ЗароботнаяПлатаОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстСообщения = "Сумма выплат превышает начисление для:" + Символы.ПС;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Для Каждого ТекСтрока Из Объект.Зарплаты Цикл 
			Если ВыборкаДетальныеЗаписи.Ресторан = ТекСтрока.Ресторан Тогда
				
				Если ВыборкаДетальныеЗаписи.Сотрудник = ТекСтрока.Сотрудник Тогда
					
					Если ВыборкаДетальныеЗаписи.ЗарплатаОстаток < ТекСтрока.ЗаработнаяПлата Тогда
					
						ТекстСообщения = ТекстСообщения + ВыборкаДетальныеЗаписи.Сотрудник + Символы.ПС;
						АвансПревышаетНачисление = Истина;
						
					КонецЕсли;			
				КонецЕсли;		
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураПроверкиНачисления.Вставить("АвансПревышаетНачисление", АвансПревышаетНачисление);
	СтруктураПроверкиНачисления.Вставить("ТекстСообщения", ТекстСообщения);

	Возврат (СтруктураПроверкиНачисления);

КонецФункции

//Обработка диалога при записи документа
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаписьПриПревышенииСуммы = Истина;
		Записать();
	КонецЕсли;
	
КонецПроцедуры

//Обработка диалога после автозаполнения табличной части
&НаКлиенте
Процедура ПослеЗакрытияВопросаПерезаписи (Результат, Параметры) Экспорт
	
	//Переключаем переменную и вызываем запись, если пользователь ответил "ДА"
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаписьПриПревышенииСуммы = Истина;
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатыПриИзменении(Элемент)
	
	//Переключаем переменную, поскольку обновились данные и нужен будет диалог перед закрытием при превышении суммы аванса
	ВыполнитьЗаписьПриПревышенииСуммы = Ложь;
	//Проверку превышения начисления можно делать при изменении табличной части.(То что сделано в событии ПередЗаписью )
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	///Заполнение табличной части по кнопке
	Объект.Зарплаты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗароботнаяПлатаОстатки.Сотрудник КАК Сотрудник,
		|	ЗароботнаяПлатаОстатки.ЗарплатаОстаток КАК ЗаработнаяПлата,
		|	ЗароботнаяПлатаОстатки.Ресторан КАК Ресторан
		|ПОМЕСТИТЬ Вт_Начисления
		|ИЗ
		|	РегистрНакопления.ЗароботнаяПлата.Остатки КАК ЗароботнаяПлатаОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.Должность КАК Должность,
		|	Сотрудники.Ресторан КАК Ресторан,
		|	ЕСТЬNULL(Вт_Начисления.ЗаработнаяПлата, 0) КАК ЗаработнаяПлата
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_Начисления КАК Вт_Начисления
		|		ПО (Вт_Начисления.Сотрудник = Сотрудники.Ссылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовСтр = Объект.Зарплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
