
Процедура РедактированиеДокументаЗакрытиеСмены (ПередаваемыйОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(ПередаваемыйОбъект.Номер) Тогда
	
		НовыйДокумент 			= Документы.ЗакрытиеСмены.СоздатьДокумент();
		НовыйДокумент.Дата 		= ПередаваемыйОбъект.Дата;
		НовыйДокумент.Ресторан 	= ПередаваемыйОбъект.Ресторан;
		НовыйДокумент.Сумма 	= ПередаваемыйОбъект.Сумма;
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		
		РедактируемыйДокумент 						= ПередаваемыйОбъект.Ссылка.ПолучитьОбъект();
		РедактируемыйДокумент.Дата 		= ПередаваемыйОбъект.Дата;
		РедактируемыйДокумент.Ресторан 	= ПередаваемыйОбъект.Ресторан;
		РедактируемыйДокумент.Сумма 	= ПередаваемыйОбъект.Сумма;
		РедактируемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	

	
КонецПроцедуры
