#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата));
	Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеСмены.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
		|ГДЕ
		|	ЗакрытиеСмены.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЗакрытиеСмены.Ресторан = &Ресторан
		|	И ЗакрытиеСмены.Проведен
		|	И ЗакрытиеСмены.Ссылка <> &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда		
		Сообщить("Смена уже закрыта");
		Отказ = Истина;		
	КонецЕсли;
	
	Движения.ДенежныеСредстваСети.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваСети.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Ресторан = Ресторан;
	Движение.Выручка = Сумма;

КонецПроцедуры
#КонецОбласти 