
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Дата = '00010101' Тогда
		Объект.Дата = ТекущаяДата();
		Объект.РесторанИнкасации = ПараметрыСеанса.ТекущийРесторан;
		Объект.Офис = ПредопределенноеЗначение("Справочник.Рестораны.ЦентральныйОфис");
	КонецЕсли;
	
	///ЗАполнение выручки ресторана и сообщение о сумме долга перед поставщиками
	
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредстваСетиОстатки.ВыручкаОстаток КАК ОстатокСредствРесторана
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваСети.Остатки(, Ресторан = &Ресторан) КАК ДенежныеСредстваСетиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДолгиПоставщикамОстатки.СуммаОстаток КАК ОстатокДолгаПоставщикам
		|ИЗ
		|	РегистрНакопления.Взаиморасчеты.Остатки(, Ресторан = Ресторан) КАК ДолгиПоставщикамОстатки";
	
	Запрос.УстановитьПараметр("Ресторан", Объект.РесторанИнкасации);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДенежныеОстатки = МассивРезультатов[0].Выбрать();
	
	Пока ВыборкаДенежныеОстатки.Следующий() Цикл
		Объект.ВыручкаРесторана = ВыборкаДенежныеОстатки.ОстатокСредствРесторана;
	КонецЦикла;
	
	ВыборкаДолгиПоставщикам = МассивРезультатов[1].Выбрать();
	
	Пока ВыборкаДолгиПоставщикам.Следующий() Цикл
		ДолгПередПоставщиками = ВыборкаДолгиПоставщикам.ОстатокДолгаПоставщикам;
	КонецЦикла;
	
	

	
КонецПроцедуры

&НаКлиенте
Процедура РесторанИнкасацииПриИзменении(Элемент)
	Объект.ВыручкаРесторана = ВыручкаРесторана(Объект.РесторанИнкасации, Объект.Дата); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыручкаРесторана (Ресторан, Период)
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредстваСетиОстатки.ВыручкаОстаток КАК ВыручкаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваСети.Остатки(&Период, Ресторан.Ссылка = &Ресторан) КАК ДенежныеСредстваСетиОстатки";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ресторан", Ресторан);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ВыручкаОстаток;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьСмену(Команда)
		
	ЗакрытьСменуСервер()
	
КонецПроцедуры 

&НаСервере
Процедура ЗакрытьСменуСервер()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредстваСетиОстатки.Ресторан КАК Ресторан,
		|	ДенежныеСредстваСетиОстатки.ВыручкаОстаток КАК ВыручкаОстаток
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваСети.Остатки(&Период, Ресторан = &Ресторан) КАК ДенежныеСредстваСетиОстатки";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата()); 
	Запрос.УстановитьПараметр("Ресторан", Объект.РесторанИнкасации);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВыручкаОстаток > Объект.Сумма Тогда
			
			ДокИнкасация = Документы.ЗакрытиеСмены.СоздатьДокумент();
		
			ДокИнкасация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Иначе
			Сообщить("Сумма инкасации больше суммы остатка ресторана");
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сообщить("Общая сумма долга перед поставщиками составляет " + ДолгПередПоставщиками + " рублей.");
КонецПроцедуры



