Процедура СозданиеДокументаЗаказ (Количество, Ссылка, ИдинтификаторСтроки) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияИзмененийРепцетурыБлюдСрезПоследних.Ингридиент КАК Ингридиент,
		|	ИсторияИзмененийРепцетурыБлюдСрезПоследних.Количество КАК Количество,
		|	ИсторияИзмененийРепцетурыБлюдСрезПоследних.ЕдИзм КАК ЕдИзм
		|ИЗ
		|	РегистрСведений.ИсторияИзмененийРепцетурыБлюд.СрезПоследних(
		|			,
		|			Блюдо В
		|				(ВЫБРАТЬ
		|					ЗаказыБлюда.Блюдо КАК Блюдо
		|				ИЗ
		|					Документ.Заказы.Блюда КАК ЗаказыБлюда
		|				ГДЕ
		|					ЗаказыБлюда.Ссылка = &Ссылка
		|					И ЗаказыБлюда.ИдентификаторСтроки = &ИдентификаторСтроки)) КАК ИсторияИзмененийРепцетурыБлюдСрезПоследних";
	
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдинтификаторСтроки);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	НовыйЗаказ = Документы.РасходПродуктов.СоздатьДокумент();

	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрокаПриемник 				= НовыйЗаказ.Ингридиенты.Добавить();
		НоваяСтрокаПриемник.Номенклатура 	= ВыборкаДетальныеЗаписи.Ингридиент;
		НоваяСтрокаПриемник.Количество 		= ВыборкаДетальныеЗаписи.Количество * Количество;
		НоваяСтрокаПриемник.ЕдИзм 			= ВыборкаДетальныеЗаписи.ЕдИзм;

	КонецЦикла;
	
	
	
	
		
	НовыйЗаказ.Дата 		= ТекущаяДата();
	НовыйЗаказ.Заказ 	= Ссылка;
	НовыйЗаказ.Повар 		= ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
	
	//Для каждого СтрТабЧасть Из  Цикл
	//
	//	НоваяСтрокаПриемник 				= НовыйЗаказ.Ингридиенты.Добавить();
	//	НоваяСтрокаПриемник.Номенклатура 	= СтрТабЧасть.Номенклатура;
	//	НоваяСтрокаПриемник.Количество 		= СтрТабЧасть.Количество;
	//	НоваяСтрокаПриемник.ЕдИзм 			= СтрТабЧасть.ЕдИзм;
	//	
	//КонецЦикла;
	
	НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
