
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродуктыРесторана Расход
	Движения.ПродуктыРесторана.Записывать = Истина;
	
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из Ингридиенты Цикл
		Движение = Движения.ПродуктыРесторана.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Ресторан = ПараметрыСеанса.ТекущийРесторан;
		Движение.Номенклатура = ТекСтрокаТабличнаяЧасть1.Номенклатура;
		Движение.Количество = ТекСтрокаТабличнаяЧасть1.Количество;
		Движение.ЕдиницаИзмерения = ТекСтрокаТабличнаяЧасть1.ЕдИзм;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
