
&НаСервереБезКонтекста
Функция ИнгридиентПриИзмененииНаСервере(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураИнгридиентов.УчетнаяЕдиница КАК УчетнаяЕдиница
		|ИЗ
		|	Справочник.НоменклатураИнгридиентов КАК НоменклатураИнгридиентов
		|ГДЕ
		|	НоменклатураИнгридиентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УчетнаяЕдиница) Тогда
			
			Возврат ВыборкаДетальныеЗаписи.УчетнаяЕдиница;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ИнгридиентПриИзменении(Элемент)
	Запись.ЕдИзм = ИнгридиентПриИзмененииНаСервере(Запись.Ингридиент);
КонецПроцедуры
