#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Обновить", 10);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора (Результат, ДополнительныеПраметры) Экспорт
	
	Статус = ПолучитьЗначениеСтатусаЗаказа("ВДоставке");
	ВызовЗаписиДокумента(Элементы.Реквизит1.ТекущиеДанные.Ссылка, Результат, Статус);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьЗаказ(Команда)

	СсылкаНаЭлементСправочника = Элементы.Реквизит1.ТекущиеДанные.Ссылка;
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлементСправочника);
	ОткрытьФорму("Документ.Заказы.Форма.ФормаЗаказаНаДоставку", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйЗаказ(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Официант", ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь());
	ОткрытьФорму("Документ.Заказы.Форма.ФормаЗаказаНаДоставку", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьКурьера(Команда)
	
	Если Не Элементы.Реквизит1.ТекущиеДанные.ГотовДляДоставки Тогда
		Сообщить("Заказ не готов для доставки");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элементы.Реквизит1.ТекущиеДанные.Курьер) Тогда
		Сообщить("Курьер уже назначен!");
		Возврат;
	КонецЕсли;
	
	ЗначениеОтбора = Новый Структура;
	ЗначениеОтбора.Вставить("Должность", ЗначениеОтбора());
	ЗначениеОтбора.Вставить("Ресторан", Элементы.Реквизит1.ТекущиеДанные.Ресторан);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);

    ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработкаВыбора", ЭтотОбъект);    
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора",ПараметрыВыбора,,,,,ОписаниеОповещенияОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура Доставлен(Команда)
	
	Если Элементы.Реквизит1.ТекущиеДанные.СтатусЗаказа = ПолучитьЗначениеСтатусаЗаказа("ВДоставке") Тогда
		Статус = ПолучитьЗначениеСтатусаЗаказа("Доставлен");
		ВызовЗаписиДокумента(Элементы.Реквизит1.ТекущиеДанные.Ссылка, Элементы.Реквизит1.ТекущиеДанные.Курьер, Статус);
	Иначе
		Сообщить("Заказ не готов для доставки или уже доставлен!");//Надо разделять ошибки
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВызовЗаписиДокумента(Ссылка, Курьер, Статус)
	Документы.Заказы.ЗаписьНазначенияКурьера(Ссылка, Курьер, Статус);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеСтатусаЗаказа(Статус)
	Возврат Перечисления.СтатусЗаказа[Статус];
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеОтбора()
	Возврат Справочники.Должности.Курьер;	
КонецФункции

&НаКлиенте
Процедура Обновить()
	
	Элементы.Реквизит1.Обновить();
	
КонецПроцедуры

#КонецОбласти
