#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеСертификата(НомерСертификата) Экспорт
	
	СтруктураСертификата = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сертификат", НомерСертификата);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сертификаты.СуммаСертификата КАК СуммаСертификата,
	|	Сертификаты.Погашен КАК Погашен
	|ИЗ
	|	РегистрСведений.Сертификаты КАК Сертификаты
	|ГДЕ
	|	Сертификаты.Сертификат = &Сертификат";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураСертификата.Вставить("СуммаСертификата", ВыборкаДетальныеЗаписи.СуммаСертификата);
		СтруктураСертификата.Вставить("Погашен", ВыборкаДетальныеЗаписи.Погашен);
		Возврат СтруктураСертификата;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция СуммаВыдачиБонуснойКарты() Экспорт
	
	Возврат Константы.СуммаВыдачиБонуснойКарты.Получить();
	
КонецФункции

Функция КоличествоЗаказовклиентаИРазмерСкидки(Ссылка) Экспорт
	
	СтруктураЗаказыКлиента = Новый Структура;
	СтруктураЗаказыКлиента.Вставить("КоличествоСделанныхЗаказаов", 0);
	СтруктураЗаказыКлиента.Вставить("Итого", 0);
	СтруктураЗаказыКлиента.Вставить("ТипКарты", Неопределено);
	СтруктураЗаказыКлиента.Вставить("Размер", Неопределено);

	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоличествоЗаказовАкцияОстатки.КоличествоОстаток КАК КоличествоСделанныхЗаказаов,
	|	КоличествоЗаказовАкцияОстатки.ИтогоОстаток / КоличествоЗаказовАкцияОстатки.КоличествоОстаток КАК Итого
	|ИЗ
	|	РегистрНакопления.КоличествоЗаказовАкция.Остатки КАК КоличествоЗаказовАкцияОстатки
	|ГДЕ
	|	КоличествоЗаказовАкцияОстатки.Клиент.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СкидочныеКарты.Размер КАК Размер,
	|	СкидочныеКарты.ТипКарты.Ссылка КАК ТипКартыСсылка
	|ИЗ
	|	Справочник.СкидочныеКарты КАК СкидочныеКарты
	|ГДЕ
	|	СкидочныеКарты.Клиент.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураЗаказыКлиента.Вставить("КоличествоСделанныхЗаказаов",
			ВыборкаДетальныеЗаписи.КоличествоСделанныхЗаказаов);
		СтруктураЗаказыКлиента.Вставить("Итого", ВыборкаДетальныеЗаписи.Итого);
	КонецЕсли;

	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураЗаказыКлиента.Вставить("ТипКарты", ВыборкаДетальныеЗаписи.ТипКартыСсылка);
		СтруктураЗаказыКлиента.Вставить("Размер", ВыборкаДетальныеЗаписи.Размер);
	КонецЕсли;

	Возврат СтруктураЗаказыКлиента;
	
КонецФункции



#КонецОбласти