Функция ПолучитьЗаказы() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказы.Ссылка КАК Link,
		|	Заказы.Номер КАК Number,
		|	Заказы.Дата КАК Date,
		|	Заказы.Ресторан КАК Restourant
		|ИЗ
		|	Документ.Заказы КАК Заказы";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Массив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура("Link, Number, Date, Restourant");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		Массив.Добавить(Структура);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Массив);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Возврат СтрокаJSON;

	
КонецФункции
