
&НаКлиенте
Процедура ДобавитьНовуюПричинуОтказа(Команда)
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ПричиныОтказаОтБлюд.ФормаОбъекта",,,,,,Оп);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеОкончания(Результать, Параметры) Экспорт
	
	ОбновитьСписок();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьСписок();
	
КонецПроцедуры

Процедура ОбновитьСписок()
	
	ПричинаОтказаТЗ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПричиныОтказаОтБлюд.Ссылка КАК ПричинаОтказа,
		|	КОЛИЧЕСТВО(ИсторияОтказовОтБлюд.Причина) КАК Причина
		|ИЗ
		|	Справочник.ПричиныОтказаОтБлюд КАК ПричиныОтказаОтБлюд
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияОтказовОтБлюд КАК ИсторияОтказовОтБлюд
		|		ПО ПричиныОтказаОтБлюд.Ссылка = ИсторияОтказовОтБлюд.Причина
		|
		|СГРУППИРОВАТЬ ПО
		|	ПричиныОтказаОтБлюд.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Причина УБЫВ"
		;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ПричинаОтказаТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОповеститьОВыборе(Элементы.ПричинаОтказаТЗ.ТекущиеДанные.ПричинаОтказа);
	
КонецПроцедуры

