
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Ресторан = ПараметрыСеанса.ТекущийРесторан;
		Объект.Директор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере() 
	
	//Проверка
	
	
	Объект.Зарплаты.Очистить();

	
	СледующийМесяц = Месяц(ТекущаяДата())+1;
	Если СледующийМесяц > 12 Тогда
		СледующийМесяц = 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СуммаЗаказовКлиентыОбороты.Официант КАК Официант,
		|	ВЫБОР
		|		КОГДА СуммаЗаказовКлиентыОбороты.СуммаЗаказаОборот > 200000
		|			ТОГДА СуммаЗаказовКлиентыОбороты.СуммаЗаказаОборот * 0.01
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Премия
		|ПОМЕСТИТЬ ВТ_Премия
		|ИЗ
		|	РегистрНакопления.СуммаЗаказовКлиенты.Обороты(, , Месяц, Ресторан = &Ресторан) КАК СуммаЗаказовКлиентыОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО СуммаЗаказовКлиентыОбороты.Официант = Сотрудники.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	ЕСТЬNULL(РазряднаяСеткаСрезПоследних.Оклад, 0) КАК Оклад,
		|	ЕСТЬNULL(ВТ_Премия.Премия, 0) + ВЫБОР
		|		КОГДА &СледМесяц = МЕСЯЦ(Сотрудники.ДатаРождения)
		|				И ДЕНЬ(Сотрудники.ДатаРождения) < 8
		|			ТОГДА ЕСТЬNULL(РазряднаяСеткаСрезПоследних.Оклад, 0) * 0.25
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Премия,
		|	ЕСТЬNULL(РазряднаяСеткаСрезПоследних.Оклад, 0) + ЕСТЬNULL(ВТ_Премия.Премия, 0) КАК ЗаработнаяПлата,
		|	Сотрудники.Должность КАК Должность
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазряднаяСетка.СрезПоследних(, ) КАК РазряднаяСеткаСрезПоследних
		|		ПО Сотрудники.Разряд = РазряднаяСеткаСрезПоследних.Разряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Премия КАК ВТ_Премия
		|		ПО (ВТ_Премия.Официант = Сотрудники.Ссылка)
		|ГДЕ
		|	Сотрудники.Ресторан = &Ресторан
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	Должность,
		|	Оклад,
		|	Премия,
		|	ЗаработнаяПлата";
	
	Запрос.УстановитьПараметр("СледМесяц", СледующийМесяц);
	Запрос.УстановитьПараметр("Ресторан", ПараметрыСеанса.ТекущийРесторан);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовСтр = Объект.Зарплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;

КонецПроцедуры
