
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр НеоходимыеОстатки
	Движения.НеоходимыеОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из ТабличнаяЧасть1 Цикл
		Движение = Движения.НеоходимыеОстатки.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТабличнаяЧасть1.Номенклатура;
		Движение.Повар = Повар;
		Движение.Ресторан = Ресторан;
		Движение.Количество = ТекСтрокаТабличнаяЧасть1.Количество;
		Движение.УчетнаяЕдиница = ТекСтрокаТабличнаяЧасть1.УчетнаяЕдиница;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти
